Revit 2024 API
Viewport.LabelOffset Property
 The offset is a two-dimensional vector from left bottom corner of the viewport with Rotation set to None to the left end of the viewport label line. The Z coordinate is ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public XYZ LabelOffset { get; set; }
Visual Basic
Public Property LabelOffset As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ LabelOffset {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Viewport Class
Autodesk.Revit.DB Namespace